RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_dma.c
  return status;
}

/**
  * @}
  */



/** @defgroup DMA_Exported_Functions_Group3 Peripheral State and Errors functions
 *  @brief    Peripheral State and Errors functions
 *
@verbatim
 ===============================================================================
            ##### Peripheral State and Errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions allowing to
      (+) Check the DMA state
      (+) Get error code

@endverbatim
  * @{
  */

/**
  * @brief Return the DMA handle state.
  * @param hdma Pointer to a DMA_HandleTypeDef structure that contains
  *             the configuration information for the specified DMA Channel.
  * @retval HAL state
  */
HAL_DMA_StateTypeDef HAL_DMA_GetState(DMA_HandleTypeDef *hdma)
{
  /* Return DMA handle state */
  return hdma->State;
}

/**
  * @brief Return the DMA error code.
  * @param hdma Pointer to a DMA_HandleTypeDef structure that contains
  *             the configuration information for the specified DMA Channel.
  * @retval DMA Error Code
  */
uint32_t HAL_DMA_GetError(DMA_HandleTypeDef *hdma)
{
  /* Return the DMA error code */
  return hdma->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup DMA_Exported_Functions_Group4 Attributes management functions
 *  @brief    Attributes management functions
 *
@verbatim
 ===============================================================================
            ##### Attributes management functions #####
 ===============================================================================
    [..]
    This subsection provides functions allowing to
      (+) Configure the DMA channel(s) privilege and non-privilege attributes
      (+) Configure the DMA channel(s) secure and non-secure attributes from
          secure world when the system implements the security (TZEN=1)
      (+) Get the DMA channel(s) attributes

@endverbatim
  * @{
  */

/**
  * @brief Configure the DMA channel attribute(s).
  * @note  Available attributes are security and privilege protection.
  *        Each field can be set independently. Not allowed configurations
  *        are not taken into account & HAL_ERROR returned.
  * @param hdma Pointer to a DMA_HandleTypeDef structure that contains
  *             the configuration information for the specified DMA Channel.
  * @param ChannelAttributes specifies the DMA channel secure/privilege attributes.
  *        This parameter can be a one or a combination of @ref DMA_Channel_Attributes
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_DMA_ConfigChannelAttributes(DMA_HandleTypeDef *hdma, uint32_t ChannelAttributes)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t ccr;

#if defined (DUAL_CORE)
  uint32_t ccr_SECM;
#endif /* DUAL_CORE */

  /* Check the DMA peripheral handle */
  if (hdma == NULL)
  {
    status = HAL_ERROR;
    return status;
  }

  /* Check the parameters */
  assert_param(IS_DMA_ATTRIBUTES(ChannelAttributes));

  /* Read CCR register */
  ccr = READ_REG(hdma->Instance->CCR);

  /* Apply any requested privilege/non-privilege attributes */
  if ((ChannelAttributes & DMA_CHANNEL_ATTR_PRIV_MASK) != 0U)
  {
    if ((ChannelAttributes & DMA_CCR_PRIV) != 0U)
    {
      SET_BIT(ccr, DMA_CCR_PRIV);
    }
    else
    {
      CLEAR_BIT(ccr, DMA_CCR_PRIV);
    }
  }

#if defined (DUAL_CORE)
  /* Channel */
  /* Check what is the current SECM status */
  if ((hdma->Instance->CCR & DMA_CCR_SECM) == DMA_CCR_SECM)
  {
    /* Channel is currently secure */
    ccr_SECM = DMA_CCR_SECM;
  }
  else
  {
    /* Channel is currently non-secure */
    ccr_SECM = 0U;
  }

  if ((ChannelAttributes & DMA_CHANNEL_ATTR_SEC_MASK) != 0U)
  {
    if ((ChannelAttributes & DMA_CCR_SECM) != 0U)
    {
      SET_BIT(ccr, DMA_CCR_SECM);
      /* Channel changed to secure */
      ccr_SECM = DMA_CCR_SECM;
    }
    else
    {
      CLEAR_BIT(ccr, DMA_CCR_SECM);
      /* Channel changed to non-secure */
      ccr_SECM = 0U;
    }
  }

  /* Channel source */
  if ((ChannelAttributes & DMA_CHANNEL_ATTR_SEC_SRC_MASK) != 0U)
  {
    /* Configure Source security attributes */
    if ((ChannelAttributes & DMA_CCR_SSEC) != 0x0U)
    {
      /* SSEC can only be set if channel is secure */
      /* Otherwise configuration is not taken into account */
      if (ccr_SECM == 0U)
      {
        status = HAL_ERROR;
      }
      else
      {
        SET_BIT(ccr, DMA_CCR_SSEC);
      }
    }
    else
    {
      CLEAR_BIT(ccr, DMA_CCR_SSEC);
    }
  }

  /* Channel destination */
  if ((ChannelAttributes & DMA_CHANNEL_ATTR_SEC_DEST_MASK) != 0U)
  {
    /* Configure Destination security attributes */
    if ((ChannelAttributes & DMA_CCR_DSEC) != 0U)
    {
      if (ccr_SECM == 0U)
      {
        /* DSEC can only be set if channel is secure */
        /* Destination channel is non secure */
        status = HAL_ERROR;
      }
      else
      {
        SET_BIT(ccr, DMA_CCR_DSEC);
      }
    }
    else
    {
      CLEAR_BIT(ccr, DMA_CCR_DSEC);
    }
  }

#endif /* DUAL_CORE */

  /* Update CCR Register: PRIV, SECM, SCEC, DSEC bits */
  WRITE_REG(hdma->Instance->CCR, ccr);

  return status;
}

/**
  * @brief Get the attribute of a DMA channel.
  * @note  Secure and non-secure attributes are only available from secure state
  *        when the system implements the security (TZEN=1)
  * @param hdma Pointer to a DMA_HandleTypeDef structure that contains
  *             the configuration information for the specified DMA Channel.
  * @param ChannelAttributes pointer to return the attributes.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_DMA_GetConfigChannelAttributes(DMA_HandleTypeDef *hdma, uint32_t *ChannelAttributes)
{
  uint32_t read_attributes;
  uint32_t attributes;

  /* Check the DMA peripheral handle and pointer to returned value */
  if ((hdma == NULL) || (ChannelAttributes == NULL))
  {
    return HAL_ERROR;
  }

#if defined (DUAL_CORE)
  /* Get secure or non-secure attributes */
  read_attributes = READ_BIT(hdma->Instance->CCR, DMA_CCR_PRIV | DMA_CCR_SECM | DMA_CCR_SSEC | DMA_CCR_DSEC);

  /* Get privilege attributes */
  attributes = ((read_attributes & DMA_CCR_PRIV) == 0U) ? DMA_CHANNEL_NPRIV : DMA_CHANNEL_PRIV;

  /* Get security attributes */
  attributes |= ((read_attributes & DMA_CCR_SECM) == 0U) ? DMA_CHANNEL_NSEC : DMA_CHANNEL_SEC;

  /* Get security attributes of the source */
  attributes |= ((read_attributes & DMA_CCR_SSEC) == 0U) ? DMA_CHANNEL_SRC_NSEC : DMA_CHANNEL_SRC_SEC;

  /* Get security attributes of the destination */
  attributes |= ((read_attributes & DMA_CCR_DSEC) == 0U) ? DMA_CHANNEL_DEST_NSEC : DMA_CHANNEL_DEST_SEC;

#else
  /* Get privilege attributes */
  read_attributes = READ_BIT(hdma->Instance->CCR, DMA_CCR_PRIV);

  attributes = ((read_attributes & DMA_CCR_PRIV) == 0U) ? DMA_CHANNEL_NPRIV : DMA_CHANNEL_PRIV;
#endif /* DUAL_CORE */

  /* return value */
  *ChannelAttributes = attributes;

  return HAL_OK;
}
/** @addtogroup DMA_Private_Functions
  * @{
  */

/**
  * @brief Sets the DMA Transfer parameter.
  * @param hdma Pointer to a DMA_HandleTypeDef structure that contains
  *             the configuration information for the specified DMA Channel.
  * @param SrcAddress The source memory Buffer address
  * @param DstAddress The destination memory Buffer address
  * @param DataLength The length of data to be transferred from source to destination
  * @retval HAL status
  */
static void DMA_SetConfig(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength)
{
  /* Clear the DMAMUX synchro overrun flag */
  hdma->DMAmuxChannelStatus->CFR = hdma->DMAmuxChannelStatusMask;

